Repository: dennissiemensma/slack-botmydesk
Catalog: src/locales/*/LC_MESSAGES/django.po
Languages: nl

source: Home
nl: Thuis

source: Sorry, you are not whitelisted and I was too lazy to create a decent message. This bot will be public eventually, including for you... :]
nl: Sorry, je bent niet gewhitelist en ik was te lui om een fatsoenlijk bericht te maken. Hoe dan ook, uiteindelijk wordt deze bot vanzelf publiekelijk beschikbaar, ook voor jou... :]

source: Your upcoming BookMyDesk reservations
nl: Je komende boekingen in BookMyDesk

source: Sorry, an error occurred while requesting your reservations: ```{error}```
nl: Sorry, fout bij het ophalen van je reserveringen: ```{error}```

source: _No reservations found (or too far away)..._
nl: _Geen boekingen gevonden (of te ver vooruit)..._

source: {emoji} {reservation_start_text}: {current_from} to {current_to} _{current.status()}_
nl: {emoji} {reservation_start_text}: {current_from} tot {current_to} _{current.status()}_

source: {emoji} *{reservation_start_text}* from {current_from} to {current_to} _In about {natural_time_until_start} at *{location}*_
nl: {emoji} *{reservation_start_text}* van {current_from} tot {current_to} _Over zo'n {natural_time_until_start} op *{location}*_

source: 🏡 You have a *home reservation* for {today_text} ({reservation_start} - {reservation_end})
nl: 🏡 Je hebt een *thuisreservering* staan voor {today_text} ({reservation_start} - {reservation_end})

source: 🏢 You have an *office reservation* for {today_text} ({reservation_start} - {reservation_end})
nl: 🏢 Je hebt een *kantoorreservering* staan voor {today_text} ({reservation_start} - {reservation_end})

source: 🚋 You have an *external reservation* outside home/office for {today_text} ({reservation_start} - {reservation_end})
nl: 🚋 Je hebt een *extern/buiten kantoor reservering* staan voor {today_text} ({reservation_start} - {reservation_end})

source: You have *no reservation* yet for {today_text}
nl: Je hebt nog *geen reservering* voor {today_text}

source: , along with {reservation_count-1} other reservation
nl: , samen met {reservation_count-1} andere reservering

source: and you are *checked in*. _Do I even need to do anything at all?_
nl: en je bent *ingecheckt*. _Moet ik uberhaupt iets doen?_

source: and you are *checked out*. _Do I even need to do anything at all?_
nl: en je bent *uitgecheckt*. _Moet ik uberhaupt iets doen?_

source: . _Where are you today?_
nl: . _Waar ben je vandaag?_

source: 🏡 Working home
nl: 🏡 Thuiswerken

source: Are you sure?
nl: Weet je het zeker?

source: 🏡 You're working from home today. I will book a home spot for you, if you don't have one yet.
nl: 🏡 Je werkt vandaag thuis. ik boek een thuiswerkplek voor je, mocht je deze nog niet hebben.

source: Yes, continue
nl: Ja, ga door

source: No, wait
nl: Nee, wacht effe

source: 🏢 Working in the office
nl: 🏢 Op kantoor

source: 🏢 You're working at the office today. This only works if you already have a reservation. I will check you in if you are not already, no matter what time your reservation is.
nl: 🏢 Je werkt vandaag op kantoor. Dit werkt alleen als je al een plek daar geboekt had. Ik check je in dat geval in, ongeacht het tijdstip.

source: 🚋 Working externally
nl: 🚋 Extern werken

source: 🚋 You're working externally. I will book an 'external' spot for you, if you don't have one yet, and check you in as well.
nl: 🚋 Je werkt vandaag buiten de deur. Ik boek een "Externe" plek voor je, mits je deze nog niet hebt. En ik check je tevens in.

source: ❌ Not working
nl: ❌ Niet aan het werk

source: ❌ You're not working today or you're already done. I will delete your pending reservations for today (if any). Also, if you were already checked in, I'll check you out now.
nl: ❌ Je werkt niet (meer) vandaag of je bent klaar. Mocht je nog openstaande reserveringen hebben dan verwijder ik die voor je. En als je al ingecheckt was, check ik je uit.

source: 🏡 _You requested me to book you for working at home._ TODO
nl: 🏡 _Je hebt me verzocht om een thuiswerkplek voor je te boeken._ TODO

source: Sorry, not yet implemented 🧑‍💻
nl: Sorry, nog niet werkend 🧑‍💻

source: ⚠️ No office reservation found for this day. Please book an office seat and check-in anyway.
nl: ⚠️ Geen kantoorreservering gevonden voor deze dag. Boek een plek en check dan ook direct in.

source: ✔️ _I left it as-is, since you're already *checked in*._
nl: ✔️ _Ik heb het gelaten voor wat het is, gezien je al *ingecheckt* bent._

source: ⚠️ _I did nothing, as you seem to be *checked out* already?_
nl: ⚠️ _Ik heb niets gedaan, want je lijkt al *uitgecheckt*?_

source: ⚠️ *Failed to check you in* ```{error}```
nl: ⚠️ *Fout bij inchecken* ```{error}```

source: ✅ _I checked you in at {location}_
nl: ✅ _Ik heb je ingecheckt op {location}_

source: ⚠️ _Unexpected status, **I ignored your request to make sure not breaking anything**!_
nl: ⚠️ _Onverwachte status, **Ik heb je verzoek genegeerd om zeker niets stuk te maken**!_

source: 🏢 _You requested me to check you in for the office._ {report_text}
nl: 🏢 _Je hebt me verzocht om je in te checken op kantoor._ {report_text}

source: ✋ Sorry, not supported at this time
nl: ✋ Sorry, (nog) niet ondersteund

source: ✔️ No reservations found anyway
nl: ✔️ Geen reserveringen gevonden

source: • *{current_from} to {current_to}* (*{location}*)
nl: • *{current_from} tot {current_to}* (*{location}*)

source: {current_reservation_text} ✔️ _I left it as-is ({current_status})_
nl: {current_reservation_text} ✔️ _Ik heb deze gelaten voor wat het is({current_status})_

source: {current_reservation_text} ⚠️ *Failed to check you out* ```{error}```
nl: {current_reservation_text} ⚠️ *Fout bij uitchecken* ```{error}```

source: {current_reservation_text} ✅ _I checked you out_
nl: {current_reservation_text} ✅ _Ik heb je uitgecheckt_

source: {current_reservation_text} ⚠️ *Failed to delete your reservation* ```{error}```
nl: {current_reservation_text} ⚠️ *Fout bij verwijderen van je reservering* ```{error}```

source: {current_reservation_text} ✅ _I deleted your reservation_
nl: {current_reservation_text} ✅ _Ik heb je reservering verwijderd_

source: {current_reservation_text} ⚠️ _Unexpected status, **left untouched**!_
nl: {current_reservation_text} ⚠️ _Onvoorziene status, **gelaten voor wat het is**!_

source: ❌ _You requested me to clear your reservations._ {report_text}
nl: ❌ _Je hebt me verzocht je reserveringen te annuleren._ {report_text}

source: ✋ Sorry, you will need to connect me first.
nl: ✋ Sorry, je moet me eerst koppelen.

source: {settings.BOTMYDESK_NAME}: Unexpected error
nl: {settings.BOTMYDESK_NAME}: Onvoorziene fout

source: I'm not sure what to do, sorry! 🤷‍♀
nl: Ik weet niet wat ik moet doen, sorry! 🤷‍♀

source: _Please tell my creator that the following happened_: ```{error}```
nl: _Vertel mijn maker dat het volgende is gebeurd_: ```{error}```

source: _Triggered by_: ```{error_trace}```
nl: _Veroorzaakt door_: ```{error_trace}```

source: _Report to <{settings.BOTMYDESK_OWNER_SLACK_ID}>_ 🤨
nl: _Rapporteer aan <{settings.BOTMYDESK_OWNER_SLACK_ID}>_ 🤨

source: ⚙️ {settings.BOTMYDESK_NAME} preferences
nl: ⚙️ {settings.BOTMYDESK_NAME}-voorkeuren

source: _Refreshing your reservations..._
nl: _Jouw reserveringen aan het verversen..._

source: Hi {botmydesk_user.slack_name} 👋
nl: Hoi {botmydesk_user.slack_name} 👋

source: My name is {settings.BOTMYDESK_NAME}, I'm an unofficial Slack bot for BookMyDesk. I can remind you to check-in at the office or at home. Making life a bit easier for you!
nl: Mijn naam is {settings.BOTMYDESK_NAME}, ik ben een onofficiële Slack bot voor BookMyDesk. Ik kan je helpen met herinneren om te boeken of in te checken, om je leven net iets makkelijker te maken!

source: Click the preferences button above to link your BookMyDesk account to me.
nl: Klik op de voorkeuren-knop hierboven om je BookMyDesk-account aan mij te koppelen.

source: Connecting {settings.BOTMYDESK_NAME}
nl: {settings.BOTMYDESK_NAME} koppelen

source: Check your mailbox for *{botmydesk_user.slack_email}*. Enter the BookMyDesk login code you've received.
nl: Controleer je mailbox voor *{botmydesk_user.slack_email}*. Vul de BookMyDesk-logincode in die je hebt ontvangen.

source: Verify login code
nl: Verifieer logincode

source: Sorry, failed to request BookMyDesk login code: `{error}`
nl: Sorry, fout bij aanvragen BookMyDesk-inlogcode: `{error}`

source: {settings.BOTMYDESK_NAME} disconnected 👋
nl: {settings.BOTMYDESK_NAME} ontkoppeld 👋

source: I've disconnected from your BookMyDesk-account. Bye!
nl: Ik ben ontkoppeld van je BookMyDesk-account. Doei!

source: Error validating your login code. You can try it another time or restart this flow to have a new code sent to you.
nl: Fout bij het valideren van je logincode. Je kunt het nogmaals proberen of deze flow opnieuw doorlopen om een nieuwe code te ontvangen.

source: {settings.BOTMYDESK_NAME} connected 👏
nl: {settings.BOTMYDESK_NAME} gekoppeld 👏

source: Great! You've connected me to your BookMyDesk-account. Check out your preferences by clicking the button below, or by going to the 'Home' tab of this bot.
nl: Top! Je hebt me gekoppeld aan je BookMyDesk-account. Stel je voorkeuren in door op de knop hieronder te klikken, of naar de 'Home" tab van deze bot te gaan.

source: _Mark today as *working from home*. Will book a home spot for you, if you don't have one yet. No check-in required._
nl: _Markeer vandaag als *thuiswerken*. Boekt een thuisplek voor je, mocht je dat nog niet gedaan hebben. Geen check-in vereist._

source: _More commands will be available after you've connected your account by typing *`{settings.SLACK_SLASHCOMMAND_BMD}`*_.
nl: _More commando's zijn beschikbaar zodra je je account koppelt door *`{settings.SLACK_SLASHCOMMAND_BMD}`* te typen_.

source: Connecting BookMyDesk to {settings.BOTMYDESK_NAME}
nl: BookMyDesk koppelen met {settings.BOTMYDESK_NAME}

source: First, you will need to authorize me to access your BookMyDesk-account, presuming it's your Slack email address.
nl: Allereerst zul je me toegang moeten geven tot je BookMyDesk-account, er vanuitgaande dat deze overeenkomt met je Slack-emailadres.

source: Connect
nl: Koppel

source: Request BookMyDesk login code by email for *{botmydesk_user.slack_email}*? _You can enter the code on the next screen._
nl: Vraag een BookMyDesk-inlogcode aan per e-mail voor *{botmydesk_user.slack_email}*? _Je kunt de inlogcode op het volgende scherm invoeren._

source: Yes, email it
nl: Ja, verstuur

source: No, hold on
nl: Nee, wacht even

source: _You can disconnect me later at any time by accessing these preferences again._
nl: _Je kunt me later op elk moment ontkoppelen via deze voorkeuren._

source: _Loading your preferences..._
nl: _Je voorkeuren worden geladen..._

source: No
nl: Nee

source: Around 7:00
nl: Rond 7:00

source: Around 8:00
nl: Rond 8:00

source: Around 8:30
nl: Rond 8:30

source: Around 9:00
nl: Rond 9:00

source: Yes, skip
nl: Ja, sla over

source: No, notify me
nl: Nee, stuur notificatie

source: Select the days to receive a Slack reminder on for your BookMyDesk status:
nl: Geef aan op welke werkdagen je een herinnering via Slack wilt voor je BookMyDesk-status:

source: Notify you on *mondays*?
nl: Notificatie op *maandagen*?

source: Select an item
nl: Selecteer een optie

source: Notify you on *tuesdays*?
nl: Notificatie op *dinsdagen*?

source: Notify you on *wednesdays*?
nl: Notificatie op *woensdagen*?

source: Notify you on *thursdays*?
nl: Notificatie op *donderdagen*?

source: Notify you on *fridays*?
nl: Notificatie op *vrijdagen*?

source: However, should I not *not bother you* when you already seem to have booked and checked in for the day(s) above?
nl: Echter, zal ik je *niet storen* wanneer je al iets geboekt hebt/ingecheckt bent op een dag?

source: Skip notification when booked/checked in?
nl: Sla notificatie over wanneer al geboekt/ingecheckt?

source: _Connected to BookMyDesk account of *{full_name}*_
nl: _Verbonden met BookMyDesk-account van *{full_name}*_

source: Disconnect {settings.BOTMYDESK_NAME}
nl: Ontkoppel {settings.BOTMYDESK_NAME}

source: This will log me out of your BookMyDesk-account and I won't bother you anymore. *Disconnect me from your account in BookMyDesk?*
nl: Dit ontkoppelt met van je BookMyDesk-account en zal je niet meer lastig vallen. *Mijn toegang tot je BookMyDesk-account intrekken?*

source: Yes, disconnect
nl: Ja, ontkoppel

source: Nevermind, keep connected
nl: Laat maar, blijf gekoppeld

source: BotMyDesk debug message
nl: BotMyDesk debug bericht
